python基础
anaconda 傻瓜式安装 所有的库，环境变量，notebook（python写代码的环境）
机器学习
1、数学的原理推导和实际应用技巧，同等对待
2、深度学习是机器算法中神经网络算法的延伸，只不过应用的比较广。深度学习在计算机视觉和自然语言处理中更厉害一些。
3、数据--都有一个行和一个列，每一个格子是一个样本，通常方便计算，numpy是做矩阵计算的。
4、

python2和3的区别
1、2比较稳定
2、3是新的，目前我的环境就是3，而且这个环境会持续的去更新下去。
3、3的库比较多，tensorflow只能用3版本。
4、语法的区别，编码是不同的，一开始就要确定下来。
5、官网上的python3只是一个环境，一些库都是没有的，后面都是需要自己添加的。
6、anaconda 是一个集成环境，各种库都有，可以理解是一个python的大礼包：工作的环境,numpy,pandas,
必备的一些工具：pip,把环境变量都配置好了，提供了一个开发环境：notebook网页版可以写python的环境，提供了很多的资源，安装工具都比较方便
7、搭建环境是很费时间的一件事情，怎么简单怎么弄
8、linux里面的Python的自带的，不用自己安装了。
9,使用pip安装库比较快